Revit 2027 API
BuiltInFailures.BendFailures.NotBentRefLine Property
 While making curved beam type "[Type Name]" some Reference Line elements were not created
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotBentRefLine { get; }
Public Shared ReadOnly Property NotBentRefLine As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotBentRefLine {
	FailureDefinitionId^ get ();
}
static member NotBentRefLine : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.BendFailures Class
Autodesk.Revit.DB Namespace